## CRUD(Create/Read/Update/Delete) of dict
### Create a dict

In [1]:
subject_grades = {}
type(subject_grades)

dict

### Create some key: value pairs

In [2]:
subject_grades['國'] = [90, 87, 70]
subject_grades['英'] = [88, 80, 90]
subject_grades['數'] = [20, 30, 40]
subject_grades

{'國': [90, 87, 70], '數': [20, 30, 40], '英': [88, 80, 90]}

### print(dict)看到的順序，非新增時的順序，是排序過的順序

In [3]:
print(list(subject_grades))   # 印出keys的list
print(sorted(subject_grades)) # 印出keys排序過的list

['國', '英', '數']
['國', '數', '英']

### Read a value

In [4]:
subject_grades['數']

[20, 30, 40]

### Update a value

In [5]:
subject_grades['數'] = [60, 60, 60]
subject_grades

{'國': [90, 87, 70], '數': [60, 60, 60], '英': [88, 80, 90]}

### Delete a key: value pair

In [6]:
del subject_grades['數']
subject_grades

{'國': [90, 87, 70], '英': [88, 80, 90]}

## CRUD of DataFrame

### Create a DataFrame

In [7]:
import pandas as pd
df = pd.DataFrame(subject_grades)
df

    國   英
0  90  88
1  87  80
2  70  90

In [8]:
students = ['張三', '李四', '陳五']
df = pd.DataFrame(data=subject_grades, index=students)
df

     國   英
張三  90  88
李四  87  80
陳五  70  90

### Create a Series

In [9]:
df['數'] = [60, 60, 60]
df

     國   英   數
張三  90  88  60
李四  87  80  60
陳五  70  90  60

In [10]:
series = pd.Series(data=[90, 90, 90], index=students, name='資')
series

張三    90
李四    90
陳五    90
Name: 資, dtype: int64

In [11]:
df[series.name] = series
df

     國   英   數   資
張三  90  88  60  90
李四  87  80  60  90
陳五  70  90  60  90

### Read a Series

In [12]:
df['國']

張三    90
李四    87
陳五    70
Name: 國, dtype: int64

In [13]:
df['國']['李四']

87

In [14]:
print(type(df))
print(type(df['國']))
print(type(df['國']['李四']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'numpy.int64'>

In [15]:
# 用loc方法會先index列
print(df.loc['李四'])
print(df.loc['李四']['國'])
print(type(df.loc['李四']))
print(type(df.loc['李四']['國']))

國    87
英    80
數    60
資    90
Name: 李四, dtype: int64
87
<class 'pandas.core.series.Series'>
<class 'numpy.int64'>

### Update a Series

In [16]:
df['國'] = [100, 100, 100]
df

      國   英   數   資
張三  100  88  60  90
李四  100  80  60  90
陳五  100  90  60  90

### Delete a Series

In [17]:
del df['國']
df

     英   數   資
張三  88  60  90
李四  80  60  90
陳五  90  60  90

### Read some Series

In [18]:
list_to_read = ['資', '英', '英', '數', '英', '數', '資', '資']
df[list_to_read]

     資   英   英   數   英   數   資   資
張三  90  88  88  60  88  60  90  90
李四  90  80  80  60  80  60  90  90
陳五  90  90  90  60  90  60  90  90

### Update columns or rows order

In [19]:
df

     英   數   資
張三  88  60  90
李四  80  60  90
陳五  90  60  90

In [20]:
df = df[ ['資', '英', '數'] ]
df

     資   英   數
張三  90  88  60
李四  90  80  60
陳五  90  90  60

In [21]:
df = df.loc[ ['陳五', '李四', '張三'] ]
df

     資   英   數
陳五  90  90  60
李四  90  80  60
張三  90  88  60